src/cf/Enums/ТипыДокументовРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовРаспознаваниеДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктОбОказанииУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеопределенныйДокумент</Name>
					<Comment>Форма документа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйЧек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РаспознаваниеДокументовКлиентСерверПереопределяемый/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ТипДокументаИВидОперации(ИмяКоманды, Результат) Экспорт
	
	ИмяКоманды = СтрЗаменить(ИмяКоманды, "Форма", "");
	Если ИмяКоманды = "СоздатьРеализацияПродажаКомиссия" Тогда
		Результат.ТипДокумента = "уатРеализацияУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьРеализацияТовары" Тогда
		Результат.ТипДокумента = "уатРеализацияУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьРеализацияУслуги" Тогда
		Результат.ТипДокумента = "уатРеализацияУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеПокупкаКомиссия" Тогда
		Результат.ТипДокумента = "уатПоступлениеТоваровУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеТовары" Тогда
		Результат.ТипДокумента = "уатПоступлениеТоваровУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьПоступлениеУслуги" Тогда
		Результат.ТипДокумента = "уатПоступлениеТоваровУслуг";
	ИначеЕсли ИмяКоманды = "СоздатьАвансовыйОтчетТовары" Тогда
		Результат.ТипДокумента = "АвансовыйОтчет";
	ИначеЕсли ИмяКоманды = "СоздатьАвансовыйОтчетПрочее" Тогда
		Результат.ТипДокумента = "АвансовыйОтчет";
	ИначеЕсли ИмяКоманды = "СоздатьАвансовыйОтчетПоКомандировке" Тогда
		Результат.ТипДокумента = "АвансовыйОтчет";
	ИначеЕсли ИмяКоманды = "СоздатьПутевойЛист" Тогда
		Результат.ТипДокумента = "ПутевойЛист";
	ИначеЕсли ИмяКоманды = "СоздатьРасходыПредпринимателя" Тогда
		Результат.ТипДокумента = "РасходыПредпринимателя";
	Иначе
		Результат = Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ТипДокументаИВидОперацииДляДокументаПоУмолчанию(Направление, ТипДокумента, Результат) Экспорт
	
	Если Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Входящий") Тогда
		Результат.ТипДокумента = "уатПоступлениеТоваровУслуг";
	Иначе
		Результат.ТипДокумента = "уатРеализацияУслуг";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодходящиеТипыРаспознанногоДокумента(ТипДокумента, Результат) Экспорт
	
	Результат = Новый Массив;
	Если ТипДокумента = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика")
		Или ТипДокумента = Тип("ДокументСсылка.уатСчетНаОплатуПокупателю") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату"));
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг")
		Или ТипДокумента = Тип("ДокументСсылка.уатРеализацияУслуг") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.ТОРГ12"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг"));
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.УПД"));
		// Т.к. поступление или реализацию можно создать по распознанной СФ
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура"));
	ИначеЕсли ТипДокумента = ТипДокумента = Тип("ДокументСсылка.уатСчетФактураВыданный") Тогда
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.СчетФактура"));
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.уатАвансовыйОтчет")
		Или ТипДокумента = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовРаспознаваниеДокументов.КассовыйЧек"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииПараметровВыбораДоговора(ДокументОбъект, ПараметрыВыбораДоговора) Экспорт
	
	ВидыДоговоров = Новый Массив;
	Если ДокументОбъект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияРаспознанногоДокумента.Исходящий") Тогда
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
	Иначе
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку"));
	КонецЕсли;
	
	ПараметрыВыбораДоговора.Вставить("ВидыДоговоров", ВидыДоговоров);
	
КонецПроцедуры

Процедура ОбязательныеРеквизитыПодчиненногоДокумента(ЭтотТипДокумента1С, ТипИВид, Реквизиты) Экспорт

	Если ЭтотТипДокумента1С = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
		Реквизиты.Вставить("НомерДокумента");
		Реквизиты.Вставить("ДатаДокумента");
		Реквизиты.Вставить("Склад");
	ИначеЕсли ЭтотТипДокумента1С = Тип("ДокументСсылка.уатРеализацияУслуг") Тогда
		
		Реквизиты.Вставить("НомерДокумента");
		Реквизиты.Вставить("ДатаДокумента");
		
	ИначеЕсли ЭтотТипДокумента1С = Тип("ДокументСсылка.уатСчетФактураВыданный") Тогда
		
		Реквизиты.Вставить("НомерДокумента");
		Реквизиты.Вставить("ДатаДокумента");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьАналитикуУчета(СтрокаТабличнойЧасти, ПараметрыОбъекта) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
